Tekla.Structures.ModelInternal.ICDelegate.ExportUIObjectPick(Tekla.Structures.ModelInternal.dotUIPicker_t@)
DO NOT USE! For internal usage only!
pPicker:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportUIObjectsPick(Tekla.Structures.ModelInternal.dotUIPicker_t@)
DO NOT USE! For internal usage only!
pPicker:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportGetCommitData(Tekla.Structures.Internal.dotIdentifier_t@,System.Int32@,System.Int32@,System.Int32@)
DO NOT USE! For internal usage only!
pId:
pObjectType:
pObjectSubType:
pCommitType:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ResetExternalReferenceModelColoring(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetReferenceModelObjectCustomAttributes(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
refererenceModelObjectId:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ImportSemantic(System.String,System.String)
DO NOT USE! For internal usage only!
aPath:
aBasePointGuid:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
aOutPath:
aBasePointGuid:
aBasePointExportType:
aExportType:
aPropertiesPath:
selectedOnly:
assemblies:
allAssemblyParts:
parts:
rebars:
bolts:
welds:
surfaces:
surfaceTreatments:
grids:
spatialHierarchy:
pours:
onlyProperties:

Tekla.Structures.ModelInternal.ICDelegate.ExportRenderGraphicContainer(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicLine}@,System.Collections.Generic.List{Tekla.Structures.Model.UI.GraphicPolyLine}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicFace}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicText}@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSetPrintingController(Tekla.Structures.ModelInternal.PrintingController)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetPrintingController(Tekla.Structures.ModelInternal.PrintingController@)
